import streamlit as st

st.sidebar.write('--------------------------------------------------')
st.sidebar.write('サイドバーに表示する')
st.sidebar.write('--------------------------------------------------')
text = st.sidebar.text_input('テキストを入力')
'--------------------------------------------------'
'テキストボックス入力値：', text
'--------------------------------------------------'


'--------------------------------------------------'
st.write('2カラムで表示する')
'--------------------------------------------------'
left_column, right_column = st.columns(2)
butoon = left_column.button('クリックして右カラムに文字を表示する→')
if butoon:
  right_column.write('表示された')


'--------------------------------------------------'
st.write('expanderで表示する')
'--------------------------------------------------'
expander1 = st.expander('問い合わせ1')
expander1.write('問い合わせ1の回答')
expander2 = st.expander('問い合わせ2')
expander2.write('問い合わせ2の回答')
expander2 = st.expander('問い合わせ3')
expander2.write('問い合わせ3の回答')

'--------------------------------------------------'
